<?php

    $x = $_GET['x'];
    echo "Получено число: ".$x."<br /><br />";
    $a = 1;
    $b = 1;
    
    while (true)
    {
        if ($a > $x)
       {
            echo "Задуманное число НЕ входит в числовой ряд Фибоначчи.";
            break;
        }
        else
        {
            if ($a == $x)
            {
                echo "Задуманное число входит в числовой ряд Фибоначчи.";
                break 1;
            }
            else
            {
                $c = $a;
                $a = $a + $b;
                $b = $c;
                continue 1;
            }
        }

        echo "Задуманное число входит в числовой ряд Фибоначчи.";
        break;
    }
 
?>
